app/controllers/user_controller.rb

INSERT INTO "users" ("name", "phone", "email", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Za"], ["phone", "32 48 424 39"], ["email", "za@za.com"], ["password_digest", "$2a$10$px8IdmgBINsJe2TrtDpIvOq47/4B.Hc1U4LcW2v9HT8dNEe6WYJQW"]]
---
  def create
  	puts '*' * 100
  	User.create(name: params[:name] , phone: params[:phone] , email: params[:email] , password: params[:password])